21mw12/CW32_Voltammeter/电压电流表资料/4 进阶程序/电压电流表程序6（6位数字电压表，电压通道）/Driver/cw32f003_adc.c
	ADC_SingleChCommon(ADC_SingleChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SingleChMoreMode);
	CW_ADC->CR2_f.CNT = cntAdcSample;
}

/**
 * @brief
 *        ADC单通道连续转换模式配置
 * 
 * @param ADC_SingleChStruct 
 */
void ADC_SingleChContinuousModeCfg(ADC_SingleChTypeDef *ADC_SingleChStruct)
{
	ADC_SingleChCommon(ADC_SingleChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SingleChContinuousMode);
}

/**
 * @brief 
 *        ADC序列转换模式公共配置
 * 
 * @param ADC_SerialChStruct 
 */
void ADC_SerialChCommon(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
	if (NULL == ADC_SerialChStruct)
	{
		return;
	}

	ADC_Init(&ADC_SerialChStruct->ADC_InitStruct);

	switch (ADC_SerialChStruct->ADC_SqrEns)
	{
	case ADC_SqrEns0:
		ADC_Sqr0ChannelCfg(ADC_SerialChStruct);
		break;
	case ADC_SqrEns01:
		ADC_Sqr01ChannelCfg(ADC_SerialChStruct);
		break;
	case ADC_SqrEns02:
		ADC_Sqr02ChannelCfg(ADC_SerialChStruct);
		break;
	case ADC_SqrEns03:
		ADC_Sqr03ChannelCfg(ADC_SerialChStruct);
		break;

	default:
		break;
	}

}

/**
 * @brief 
 *        ADC序列连续转换模式配置
 * 
 * @param ADC_SerialChStruct 
 */
void ADC_SerialChContinuousModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
	ADC_SerialChCommon(ADC_SerialChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChContinuousMode);
}

/**
 * @brief 
 *        ADC序列扫描转换模式配置
 * 
 * @param ADC_SerialChStruct 
 */
void ADC_SerialChScanModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
	ADC_SerialChCommon(ADC_SerialChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChScanMode);
}

/**
 * @brief 
 *        ADC序列多次转换模式配置
 * 
 * @param ADC_SerialChStruct 
 * @param cntAdcSample: 0 ~ 255
 */
void ADC_SerialChMoreModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct,
		uint8_t cntAdcSample)
{
	ADC_SerialChStruct->ADC_InitStruct.ADC_AccEn = ADC_AccEnable;	//Must be added

	ADC_SerialChCommon(ADC_SerialChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChMoreMode);

	CW_ADC->CR2_f.CNT = cntAdcSample;
}

/**
 * @brief 
 *        ADC序列断续转换模式配置
 * 
 * @param ADC_SerialChStruct 
 */
void ADC_SerialChBreakModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
	ADC_SerialChCommon(ADC_SerialChStruct);
	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChBreakMode);
}

/**
 * @brief   
 *          单通道模式的内置跟随器使能
 *
 * @param   enAdcSampCh:
 *          @arg ADC_ExInputCH0
 *          @arg ADC_ExInputCH1
 *          @arg ADC_ExInputCH2
 *          @arg ADC_ExInputCH3
 *          @arg ADC_ExInputCH4
 *          @arg ADC_ExInputCH5
 *          @arg ADC_ExInputCH6
 *          @arg ADC_ExInputCH7
 *          @arg ADC_ExInputCH8
 *          @arg ADC_ExInputCH9
 *          @arg ADC_ExInputCH10
 *          @arg ADC_ExInputCH11
 *          @arg ADC_ExInputCH12
 *          @arg ADC_VddDiv3Input
 *          @arg ADC_TsInput
 *          @arg ADC_Vref1P2Input
 */
void ADC_BufEnSingleCh(uint32_t enAdcSampCh)
{
	if ((enAdcSampCh == ADC_VddDiv3Input) || (enAdcSampCh == ADC_TsInput)
			|| (enAdcSampCh == ADC_Vref1P2Input))
	{
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_BUF_Msk);
	}

	if (enAdcSampCh == ADC_Vref1P2Input)
	{
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_BGREN_Msk);
	}

	//如果ADC通道选择了内置温度传感器输出电压，则需要使能内置温度传感器
	else if (enAdcSampCh == ADC_TsInput)
	{
		//使能内置温度传感器
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_TSEN_Msk);
	}
        else{}
}

/**
 * @brief 
 *          序列模式的内置跟随器使能
 * 
 * @param enAdcSampCh:
 *        @arg ADC_SqrCh0
 *        @arg ADC_SqrCh1
 *        @arg ADC_SqrCh2
 *        @arg ADC_SqrCh3
 *        @arg ADC_SqrCh4
 *        @arg ADC_SqrCh5
 *        @arg ADC_SqrCh6
 *        @arg ADC_SqrCh7
 *        @arg ADC_SqrCh8
 *        @arg ADC_SqrCh9
 *        @arg ADC_SqrCh10
 *        @arg ADC_SqrCh11
 *        @arg ADC_SqrCh12
 *        @arg ADC_SqrVddDiv3
 *        @arg ADC_SqrTs
 *        @arg ADC_SqrVref1P2
 */
void ADC_BufEnSerialCh(uint32_t enAdcSampCh)
{
	if ((enAdcSampCh == ADC_SqrVddDiv3) || (enAdcSampCh == ADC_SqrTs)
			|| (enAdcSampCh == ADC_SqrVref1P2))
	{
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_BUF_Msk);
	}

	if (enAdcSampCh == ADC_SqrVref1P2)
	{
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_BGREN_Msk);
	}

	//如果ADC通道选择了内置温度传感器输出电压，则需要使能内置温度传感器
	else if (enAdcSampCh == ADC_SqrTs)
	{
		//使能内置温度传感器
		REGBITS_SET(CW_ADC->CR0, ADC_CR0_TSEN_Msk);
	}
        else {}
}

/**
 * @brief   
 *          序列SQR0转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr0ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    //ASSERT(NULL != ADC_SerialChStruct);
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));

	//ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns0;
	REGBITS_MODIFY(CW_ADC->SQR, ADC_SQR_ENS_Msk | ADC_SQR_SQR0_Msk,
			ADC_SerialChStruct->ADC_SqrEns |\
            ADC_SerialChStruct->ADC_Sqr0Chmux);

	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
}

/**
 * @brief
 *          序列SQR0/SQR1转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr01ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    //ASSERT(NULL != ADC_SerialChStruct);
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));

	//ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns01;
	REGBITS_MODIFY(CW_ADC->SQR,
			ADC_SQR_ENS_Msk | ADC_SQR_SQR0_Msk | ADC_SQR_SQR1_Msk,
			ADC_SerialChStruct->ADC_SqrEns |\
            (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR_SQR1_Pos) |\
            ADC_SerialChStruct->ADC_Sqr0Chmux);

	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR2转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr02ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    //ASSERT(NULL != ADC_SerialChStruct);
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns02;
	REGBITS_MODIFY(CW_ADC->SQR,
			ADC_SQR_ENS_Msk | ADC_SQR_SQR0_Msk |\
            ADC_SQR_SQR1_Msk | ADC_SQR_SQR2_Msk,
			ADC_SerialChStruct->ADC_SqrEns |\
            (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR_SQR2_Pos) |\
            (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR_SQR1_Pos) |\
            ADC_SerialChStruct->ADC_Sqr0Chmux);

	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR2转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr03ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    //ASSERT(NULL != ADC_SerialChStruct);
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux ));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux ));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns ));

    //ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
	REGBITS_MODIFY(CW_ADC->SQR,
			ADC_SQR_ENS_Msk | ADC_SQR_SQR0_Msk |\
            ADC_SQR_SQR1_Msk | ADC_SQR_SQR2_Msk | ADC_SQR_SQR3_Msk,
			ADC_SerialChStruct->ADC_SqrEns |\
            (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR_SQR3_Pos) |\
            (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR_SQR2_Pos) |\
            (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR_SQR1_Pos) |\
            ADC_SerialChStruct->ADC_Sqr0Chmux);

	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
	ADC_BufEnSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
}

/**
 * @brief   
 *          获取单次转换采样值
 *
 * @param
 * 
 * @return uint16_t 
 */
uint16_t ADC_GetConversionValue(void)
{
	return (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief   
 *          获取SQR0通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr0Result(uint16_t* pAdcResult)
{
	if (NULL == pAdcResult)
	{
		return;
	}
	*pAdcResult = (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief 
 *          获取SQR1通道采样值
 * 
 * @param   pAdcResult
 */
void ADC_GetSqr1Result(uint16_t* pAdcResult)
{
	if (NULL == pAdcResult)
	{
		return;
	}
	*pAdcResult = (uint16_t)(CW_ADC->RESULT1);
}

/**
 * @brief 
 *          获取SQR2通道采样值
 * 
 * @param   pAdcResult
 */
void ADC_GetSqr2Result(uint16_t* pAdcResult)
{
	if (NULL == pAdcResult)
	{
		return;
	}
	*pAdcResult = (uint16_t)(CW_ADC->RESULT2);
}

/**
 * @brief 
 *          获取SQR3通道采样值
 * 
 * @param   pAdcResult
 */
void ADC_GetSqr3Result(uint16_t* pAdcResult)
{
	if (NULL == pAdcResult)
	{
		return;
	}
	*pAdcResult = (uint16_t)(CW_ADC->RESULT3);
}

/**
 * @brief   
 *          获取累加采样值
 *
 * @param   pAdcAccResult
 */
void ADC_GetAccResult(uint32_t* pAdcAccResult)
{
	if (NULL == pAdcAccResult)
	{
		return;
	}

	*pAdcAccResult = (uint32_t)(CW_ADC->RESULTACC);
}

/**
 * @brief   
 *          清零累加采样值
 */
void ADC_ClrAccResult(void)
{
	REGBITS_SET(CW_ADC->CR2, ADC_CR2_ACCRST_Msk);
}

/**
 * @brief   
 *          设置ADC参考电压
 *
 * @param   ADC_VrefSel:
 *          @arg ADC_Vref_BGR1p5
 *          @arg ADC_Vref_BGR2p5
 *          @arg ADC_Vref_Extern1
 *          @arg ADC_Vref_VDD
 */
void ADC_SetVref(uint32_t ADC_VrefSel)
{
    assert_param(IS_ADC_VREF_SEL(ADC_VrefSel ));

	REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_REF_Msk,
			ADC_VrefSel);
    if (ADC_VrefSel == ADC_Vref_Extern1)
	{
		//初始化ExRef：PB04
		REGBITS_SET( CW_SYSCTRL->AHBEN, SYSCTRL_AHBEN_GPIOB_Msk);//打开GPIO时钟
		PB04_ANALOG_ENABLE();
	}
}
/**
 * @brief   
 *          设置ADC结果对齐方式
 *
 * @param   enAlign:
 *          @arg ADC_AlignRight
 *          @arg ADC_AlignLeft
 */
void ADC_SetAlign(uint32_t enAlign)
{
	REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_ALIGN_Msk, enAlign);
}

/**
 * @brief 
 *        设置单通道ADC转换结果溢出保存策略
 * 
 * @param enDiscard:
 *        @arg ADC_DiscardNull
 *        @arg ADC_DiscardEnable
 */
void ADC_SetDiscard(uint32_t enDiscard)
{
    assert_param(IS_ADC_DATA_DISCARD(enDiscard));
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DISCARD_Msk, enDiscard);
}

/**
 * @brief 
 *        设置内置温度传感器使能控制
 * 
 * @param enTs:
 *        @arg ADC_TsDisable
 *        @arg ADC_TsEnable
 */
void ADC_SetTs(uint32_t enTs)
{
    assert_param(IS_ADC_TS_ENABLE(enTs));
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_TSEN_Msk, enTs);

